from chatterbot import ChatBot
from chatterbot.trainers import ListTrainer

# Create a new chat bot named Charlie
chatbot = ChatBot('Omar')

# logic_adapters=[
#      'chatterbot.logic.MathematicalEvaluation',
#      'chatterbot.logic.TimeLogicAdapter',
#   ],
trainer = ListTrainer(chatbot)

trainer.train([
    "مرحبا",
    "اهلا",
    "السلام عليكم",
    "عليكم السلام",
    "ما اسمك؟",
    "انا روبوت اقدم لك المعلومات عن تخصص انظمة الحاسوب",
    "ما اسم هذا المكان؟",
    "نحن في الجامعة العربية الامريكية. في كلية الهندسة وتكنولوجيا المعلومات.",
    "هل تستطيع ان تعطيني نظرة عامة عن التخصص",
    """ 
    نعم بالتأكيد.
    في ظل التطور التكنولوجي المستمر هنالك طلب متزايد على الكفاءات والمهارات المتميزة في مجال هندسة الحاسوب على الصعيد الوطني والعربي والعالمي. 
يقدم قسم هندسة انظمة الحاسوب في الجامعة العربية الأمريكية للطلاب برنامجًا مبتكرًا لتلبية الاحتياجات الحالية واحتياجات السوق المستقبلية في سوق العمل المحلي والدولي.     
يعد خريجي تخصص هندسة انظمة الحاسوب الاكثر طلبا في الشركات التي تقوم بالبرمجة، والتصميم، والتطوير، والاختبار، والإشراف على معدات الحاسوب والشبكات أو تركيبها، ويتم توظيفهم أيضاً في معظم القطاعات الحكومية والخاصة.     
     """,
    "ما هو عدد الساعات المعتمدة",
    "163 ساعة",
    "ما هي مجالات عمل التخصص",
    """ 
1.	تصميم وتطوير برمجيات الحاسوب وبرمجيات الأجهزة الخلوية.
2.	تصميم وإدارة الشبكات وأمن الشبكات.
3.	تصميم وتطوير برمجيات قواعد البيانات.
4.	برمجيات الإنترنت وتطبيقاتها.
5.	المؤسسات الصناعية التي تعنى ببناء أنظمة التحكم.
6.	الشركات التي توفر حلول بواسطة أنظمة الحاسوب.
7.	باحث في مجال الحاسوب.

    """,

])
