from chatterbot import ChatBot
from chatterbot.trainers import ListTrainer
from chatterbot.trainers import ChatterBotCorpusTrainer

# Create a new chat bot named Charlie
chatbot = ChatBot('Leila')

# logic_adapters=[
#      'chatterbot.logic.MathematicalEvaluation',
#      'chatterbot.logic.TimeLogicAdapter',
#   ],
trainer = ListTrainer(chatbot)

trainer.train([
    "ما اسمك؟",
    "انااسمي ليلى.اقدم المعلومات عن تخصص انظمة الحاسوب",
    "شو اسمك؟",
    "انااسمي ليلى.اقدم المعلومات عن تخصص انظمة الحاسوب",
    "ما اسم هذا المكان؟",
    "نحن في الجامعة العربية الامريكية. في كلية الهندسة وتكنولوجيا المعلومات.",
    "اين نحن؟",
    "نحن في الجامعة العربية الامريكية. في كلية الهندسة وتكنولوجيا المعلومات.",
    "هل تستطيع ان تعطيني نظرة عامة عن التخصص؟",
    """ 
    نعم بالتأكيد.
    في ظل التطور التكنولوجي المستمر هنالك طلب متزايد على الكفاءات والمهارات المتميزة في مجال هندسة الحاسوب على الصعيد الوطني والعربي والعالمي. 
يقدم قسم هندسة انظمة الحاسوب في الجامعة العربية الأمريكية للطلاب برنامجًا مبتكرًا لتلبية الاحتياجات الحالية واحتياجات السوق المستقبلية في سوق العمل المحلي والدولي.     
يعد خريجي تخصص هندسة انظمة الحاسوب الاكثر طلبا في الشركات التي تقوم بالبرمجة، والتصميم، والتطوير، والاختبار، والإشراف على معدات الحاسوب والشبكات أو تركيبها، ويتم توظيفهم أيضاً في معظم القطاعات الحكومية والخاصة.     
     """,
    "اشرح لي عن التخصص",
    """ 
    نعم بالتأكيد.
    في ظل التطور التكنولوجي المستمر هنالك طلب متزايد على الكفاءات والمهارات المتميزة في مجال هندسة الحاسوب على الصعيد الوطني والعربي والعالمي. 
يقدم قسم هندسة انظمة الحاسوب في الجامعة العربية الأمريكية للطلاب برنامجًا مبتكرًا لتلبية الاحتياجات الحالية واحتياجات السوق المستقبلية في سوق العمل المحلي والدولي.     
يعد خريجي تخصص هندسة انظمة الحاسوب الاكثر طلبا في الشركات التي تقوم بالبرمجة، والتصميم، والتطوير، والاختبار، والإشراف على معدات الحاسوب والشبكات أو تركيبها، ويتم توظيفهم أيضاً في معظم القطاعات الحكومية والخاصة.     
     """,
    "ما هو عدد الساعات المعتمدة",
    "163 ساعة",
    "ما هي مجالات عمل التخصص",
    """ 
    1.	تصميم وتطوير برمجيات الحاسوب وبرمجيات الأجهزة الخلوية.
    2.	تصميم وإدارة الشبكات وأمن الشبكات.
    3.	تصميم وتطوير برمجيات قواعد البيانات.
    4.	برمجيات الإنترنت وتطبيقاتها.
    5.	المؤسسات الصناعية التي تعنى ببناء أنظمة التحكم.
    6.	الشركات التي توفر حلول بواسطة أنظمة الحاسوب.
    7.	باحث في مجال الحاسوب.
    """,

])

trainer = ChatterBotCorpusTrainer(chatbot)

trainer.train([
    "مرحبا",
    "اهلا",
    "السلام عليكم",
    "و عليكم السلام",
    "السلام عليكم",
    "و عليكم السلام، كيف يمكنني ان اساعدك",
    'مرحبا',
    'مرحبا',
    "تحية طيبة",
    'مرحبا',
    'مرحبا',
    "تحية طيبة",
    'مرحبا, كيف الحال؟',
    "جيد, شكرا",
    "مرحبا, كيف احال؟",
    "بخير,شكرا",
    "مرحبا, كيف احال؟",
    "بخير,شكرا,وكيف حالك انت؟",
    "مرحبا, كيف احال؟",
    "عظيم",
    "مرحبا، كيف احال؟",
    "يمكن ان يكون افضل",
    "مرحبا, كيف احال؟",
    "ليس بجيد",
    "كيف هي احوالك؟",
    "بخير",
    "كيف هي احوالك؟",
    "جيد جدا ،شكرا",
    "كيف هي احوالك؟",
    "جيد، وانت؟",
    "تشرفت بمقابلتك",
    "شكرا",
    "كيف حالك؟",
    "انا بافضل حال",
    "كيف حالك؟",
    "انا بحال جيدة، كيف حالك انت؟",
    "مرحبا،انا سعيد برؤيتك",
    "شكرا،وانا ايضا",
    "انه لمن دواعي سروري ان التقي بك",
    "شكرا،وانا ايضا",
    "اتمنى لك يوما جميلا",
    "شكرا لك ايها الطيب.",
    "اتمنى لك يوما جميلا",
    "ماذا تفعل؟",
    "ليس بالشيء الكثير. ادردش مع الشباب",
    "ماذا تفعل؟",
    "ليس كثيرا. ماذا عنك؟",
    "ماذا تفعل؟",
    "لا شيء",
])
